Reports/Лео_ОтчетПоСкидкам/Лео_ОтчетПоСкидкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_ОтчетПоСкидкам</name>
  <attributes>
    <name>ПутьФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нетто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РПЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Reports/Лео_ОтчетПоСкидкам/Forms/ФормаВыбора/Module.bsl
&НаКлиенте  
Процедура Выгрузить(Команда) Экспорт
	
		ЭтаФорма.Закрыть(Новый Структура("ПутьФайла, Нетто, КУ, РПЛ", Отчет.ПутьФайла, Отчет.Нетто, Отчет.КУ, Отчет.РПЛ));// Вставить содержимое обработчика.
КонецПроцедуры
	

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПутьФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	Фильтр = "Лист Excel (*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.ПроверятьСуществованиеФайла = Истина;
	ВыборФайла.Заголовок = "Выберите файл Excel для выгрузки";
	ВыборФайла.Фильтр = Фильтр;
	
	Если НЕ ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ВыборФайла.ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Отчет.ПутьФайла = ВыборФайла.ВыбранныеФайлы[0];
	
КонецПроцедуры
